import { EcoshponPDK } from '@/shared/type';

export const arrPDKEcoshpon: EcoshponPDK[] = [
    {
        model: 'К-7', //модель
        price_opt: 3100, // цена
        available_colors: 'белый бланко с черным стеклом', // доступные цвета
        other_colors: 'В других цветах не поставляется', // другие цвета
        construction: 'царговая', // тип двери
        coating: 'ПВХ', // материал
        // особенности
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм', // высота
        width: '600, 700, 800, 900 мм', // ширина
        thickness: '35 мм', // толщина
        custom_sizes: 'НЕ ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ', // возможность нестандартных размеров
        image: 'К-7.png',
    },
    {
        model: 'К-13/2', //модель
        price_opt: 3600, // цена
        available_colors: 'граф белый с черным стеклом', // доступные цвета
        other_colors: 'В других цветах не поставляется', // другие цвета
        construction: 'царговая', // тип двери
        coating: 'ПВХ', // материал
        // особенности
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм', // высота
        width: '600, 700, 800, 900 мм', // ширина
        thickness: '35 мм', // толщина
        custom_sizes: 'НЕ ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ', // возможность нестандартных размеров
        image: 'К-13.2.png',
    },
    {
        model: 'Стиль 1',
        price_opt: 2340,
        available_colors:
            'Беленый дуб, венге, орех, эшвайт, неаполь, неаполь с черным стеклом, беленый дуб с черным стеклом',
        other_colors:
            'Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +50%',
        image: 'Стиль 1.png',
    },
    {
        model: 'D-1',
        price_opt: 3120,
        available_colors: 'бетон бежевый, бетот снежный, бетон графит',
        other_colors:
            'Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +50%',
        image: 'D-1.png',
    },

    {
        model: 'D-28',
        price_opt: 3380,
        available_colors: 'Белый бланко зеркало, граф белый черное стекло',
        other_colors:
            'На заказ: эшвайт, орех, неаполь, беленый дуб, венге. Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери. ПОСТАВЛЯЮТСЯ ТОЛЬКО С ТЕЛЕСКОПИЧЕСКИМ ПОГОНАЖОМ',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'D-28.png',
    },
    {
        model: 'D-31',
        price_opt: 3380,
        available_colors:
            'бетон бежевый, бетон графит зеркало, бетон снежный черная лакобель, дуб арктик с черным стеклом, дуб пацифик с черным стеклом, велютто бьянко с черным стеклом (СКОРО В ПРОДАЖЕ)',
        other_colors:
            'Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери. ПОСТАВЛЯЮТСЯ ТОЛЬКО С ТЕЛЕСКОПИЧЕСКИМ ПОГОНАЖОМ',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'D-31.png',
    },

    {
        model: 'D-26',
        price_opt: 3380,
        available_colors:
            'бетон бежевый, бетон графит зеркало, бетон снежный черная лакобель',
        other_colors:
            'Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'ПВХ',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери. ПОСТАВЛЯЮТСЯ ТОЛЬКО С ТЕЛЕСКОПИЧЕСКИМ ПОГОНАЖОМ',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'D-26.png',
    },
    {
        model: 'D-2',
        price_opt: 3380,
        available_colors:
            'бетон бежевый, бетон графит зеркало, бетон снежный черная лакобель',
        other_colors:
            'Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'ПВХ',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери. ПОСТАВЛЯЮТСЯ ТОЛЬКО С ТЕЛЕСКОПИЧЕСКИМ ПОГОНАЖОМ',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'D-27.png',
    },

    {
        model: 'Стиль 13',
        price_opt: 3380,
        available_colors:
            'беленый дуб, венге, орех с черным стеклом, эшвайт с черным стеклом, рустик пепельный с зеркалом',
        other_colors:
            'На заказ: эшвайт, неаполь, белый бланко, белый граф. Черная лакобель, белая лакобель, графит, бронза, зеркало + 350р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2000 мм и ШИРИНА от 600 до 900 мм С УДОРОЖАНИЕМ +30%. ВЫСОТА БОЛЕЕ 2000 мм НЕ ПОСТАВЛЯЕТСЯ',
        image: 'Стиль 13.png',
    },
    {
        model: 'Стиль 39',
        price_opt: 3490,
        available_colors: 'беленый дуб, вунге, дуб арктик черным стеклом',
        other_colors:
            'На заказ: эшвайт,орех, неаполь, белый граф. Черный лакобель, белый лакобель, графит, бронза, зеркало - +350рР',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2000 мм и ШИРИНА от 600 до 900 мм С УДОРОЖАНИЕМ +30%. ВЫСОТА БОЛЕЕ 2000 мм НЕ ПОСТАВЛЯЕТСЯ',
        image: 'Стиль 39.png',
    },
    {
        model: 'Стиль 22',
        price_opt: 2810,
        available_colors: 'беленый дуб, венге, эшвайт',
        other_colors:
            'На заказ: неаполь, орех, белый бланко, дуб арктик, белый граф. Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'Стиль 22.png',
    },
    {
        model: 'Стиль 8-4',
        price_opt: 3230,
        available_colors: 'беленый дуб, венге, эшвайт',
        other_colors:
            'На заказ: неаполь, орех, белый бланко, дуб арктик, белый граф. Черная лакобель, белая лакобель, графит, бронза, зеркало + 200р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'Стиль 8-4.png',
    },
    {
        model: 'Стиль 25',
        price_opt: 3230,
        available_colors:
            'беленый дуб, неаполь, граф белый с черным стеклом, дуб арктик с зеркалом',
        other_colors:
            'На заказ: эшвайт, орех, белый бланко. Черная лакобель, белая лакобель, графит, бронза, зеркало + 350р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            "ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2000 мм и ШИРИНА от 600 мм до 900 мм С УДОРОЖАНИЕМ +30%. МОДЕЛЬ 'СТИЛЬ 25' И 'СТИЛЬ 21' БОЛЕЕ 2000 мм НЕ ПОСТАВЛЯЕТСЯ",
        image: 'Стиль 25.png',
    },
    {
        model: 'Стиль 5',
        price_opt: 3380,
        available_colors: 'беленый дуб, эшвайт, венге, орех, граф белый',
        other_colors:
            'Черная лакобель, белая лакобель, графит, бронза, зеркало + 350р.',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            "ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2000 мм ШИРИНА от 600 до 900 мм С УДОРОЖАНИЕМ +30%. МОДЕЛЬ 'СТИЛЬ 5' БОЛЕЕ 2000 мм НЕ ПОСТАВЛЯЕТСЯ",
        image: 'Стиль 5.png',
    },
    {
        model: 'Стиль 4',
        price_opt: 3180,
        available_colors: 'беленый дуб, венге, дуб арктик, дуб пацифик',
        other_colors:
            'На заказ: эшвайт, орех, неаполь, белый бланко, дуб арктик, белый граф',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'Стиль 4.png',
    },
    {
        model: 'К 8-3',
        price_opt: 3330,
        available_colors:
            'бетон снежный черный лакобель, дуб арктик с черный стеклом, дуб пацифик с черным стеклом',
        other_colors: 'В других цветах не поставляется',
        construction: 'царговая',
        coating: 'экошпон',
        features:
            'Стекло с силиконовым уплотнителем. Бесшовная технология окутывания элементов двери',
        height: '2000 мм',
        width: '600, 700, 800, 900 мм',
        thickness: '35 мм',
        custom_sizes:
            'ВОЗМОЖНО ИЗГОТОВЛЕНИЕ НЕСТАНДАРТНЫХ РАЗМЕРОВ. ВЫСОТА до 2040 мм и ШИРИНА от 350 мм до 1000 мм С УДОРОЖАНИЕМ +30%',
        image: 'К 8-3.png',
    },
];
